{
  "home": {
    "titles": {
      "title0": "Merhaba, Dünya!",
      "title1": "Benim adım Bertaç Severcan,"
    },
    "texts": {
      "text0": "Ben teknoloji ve programlamayla ilgilenen, bir junior yazılım/web geliştiricisiyim.",
      "text1": "İstanbul Bilgi Üniversitesi Yönetim Bilişim Sistemleri ve İngilizce Öğretmenliği bölümleri (ÇAP) mezunuyum ve 6 aylık Re:Coded Web Geliştirme Kampından da başarıyla mezun oldum.",
      "text2": "Python, Java, Javascript, HTML, CSS, SQL gibi programlama dillerinde deneyim sahibiyim ve hem backend hem de frontend yazılım geliştirme ile ilgileniyorum.",
      "text3": "Her zaman yenilikler peşinde olmayı ve yeni şeyler öğrenmeyi seviyorum."
    },
    "buttons": {
      "button0": "Projelerime bakın",
      "button1": "Hakkımda daha fazla"
    }
  },
  "navbar": {
    "links": {
      "link0": "Ana sayfa",
      "link1": "Hakkımda",
      "link2": "Özgeçmiş",
      "link3": "Projelerim",
      "link4": "İletişim",
      "link5": "Dil"
    },
    "languages": {
      "tr": "Türkçe",
      "en": "İngilizce"
    }
  },
  "projects": {
    "title": "Projelerim"
  },
  "contact": {
    "titles": {
      "title0": "Benimle iletişime geçin",
      "title1": "Diğer iletişim bilgileri"
    },
    "labels": {
      "label0": "E-posta adresiniz",
      "label1": "Tam adınız",
      "label2": "Konu",
      "label3": "Mesajınız"
    },
    "placeholders": {
      "holder0": "ali.veli@mail.com",
      "holder1": "Ali Veli",
      "holder2": "Ne hakkında?",
      "holder3": "Merhaba, Bertaç!"
    },
    "button": "Gönder",
    "headers": {
      "head0": "Adres",
      "head1": "Telefon",
      "head2": "E-posta Adresi",
      "head3": "Sosyal Medya"
    },
    "texts": {
      "text0": "İstanbul/Türkiye",
      "text1": "GitHub profil linki",
      "text2": "LinkedIn profil linki"
    }
  },
  "about": {
    "title": "Hi there",
    "headers": {
      "head0": "My name is Bertaç Severcan and I'm happy to introduce myself:",
      "head1": "TL;DR: I'm a junior software/web developer who is interested in both backend and frontend and I'm looking for work, hire me!"
    },
    "texts": {
      "text0": "I am a junior software/web developer from Istanbul, Turkey. I studied Management Information Systems and Teaching English As a Foreign Language(Double Majors) at Istanbul Bilgi University. I also attended and graduated from Re: Coded Web development Bootcamp(uses Flatiron School's curriculum) where I gained my skills in front-end web development.",
      "text1": "Before the Bootcamp, I started programming in Java at Bilgi University. Then I learned about SQL and RDBMS there. To improve my skills in programming, I started to learn Python myself and loved it. When I started the Re: Coded Bootcamp, I didn't know about web development and that was where I first learned about it. We started with HTML and CSS, then moved on with JavaScript. Lastly, we finished with ReactJS and I also got the chance to learn about SCRUM and experience it first hand in the capstone project.",
      "text2": "In my time within the Bootcamp, I've learned many new skills and knowledge. I've learned about Git and VCS and how important it was for my career. Also, I've worked on many projects with different partners during this time. I even formed a group of developers from the Bootcamp and attended a hackathon where we got 3'rd overall with our web-app: M.Y-Inventory. Also, right before I joined the Bootcamp, I formed my online study-group called 'Çaylak Kodcular' (Rookie Coders). It was a Discord channel open to anyone who wanted to learn about programming. From this experience, I've both gained a lot and I tried to give back too.",
      "text3": "The reason I fell in love with programming is how creative it can be, it allowed me to build something from nothing. I also realized when I started programming, I love solving problems. One time, I was working on a project, I spent my entire day working on solving the problem I had and I didn't even get bored and that's when I realized I can do this without hesitation.",
      "text4": "I'm interested in all sorts of development; mobile, web, software, video-game. But one of my goals is to build my own video-game someday. As you can easily guess from this, I love playing video-games but mostly story-driven ones.",
      "text5": "The other thing I love as much as programming is music. I play three different instruments; piano, drums, guitar and I'd like to combine my love for programming and music one day. Oh, and I also do CrossFit and I have a Level-1 trainer certificate in CrossFit. But I don't want to be that guy who talks about CrossFit all the time so I'll stop",
      "text6": "So, yeah, this is me! If you want to",
      "text7": "contact me",
      "text8": " and get to know me even more, please do!"
    }
  }
}
