{
  "home": {
    "titles": {
      "title0": "Merhaba, Dünya!",
      "title1": "Benim adım Bertaç Severcan,"
    },
    "texts": {
      "text0": "Ben teknoloji ve programlamayla ilgilenen, bir yazılım/web geliştiricisiyim.",
      "text1": "İstanbul Bilgi Üniversitesi Yönetim Bilişim Sistemleri ve İngilizce Öğretmenliği bölümleri (ÇAP) mezunuyum ve 6 aylık Re:Coded Web Geliştirme Kampından da başarıyla mezun oldum.",
      "text2": "Python, Java, Javascript, HTML, CSS, SQL gibi programlama dillerinde deneyim sahibiyim ve hem backend hem de frontend yazılım geliştirme ile ilgileniyorum.",
      "text3": "Her zaman yenilikler peşinde olmayı ve yeni şeyler öğrenmeyi seviyorum."
    },
    "buttons": {
      "button0": "Projelerime bakın",
      "button1": "Hakkımda daha fazla"
    }
  },
  "navbar": {
    "links": {
      "link0": "Ana sayfa",
      "link1": "Hakkımda",
      "link2": "Özgeçmiş",
      "link3": "Projelerim",
      "link4": "İletişim",
      "link5": "Dil"
    },
    "languages": {
      "tr": "Türkçe",
      "en": "İngilizce"
    }
  },
  "projects": {
    "titles": {
      "title0": "Projelerim",
      "title1": "Diğer projelerim"
    },
    "texts": {
      "text0": "Bu proje ile ekibim ve ben Impact Hub Innovation Hackathon 2020'de 3.lük ödülünü kazandık. Ekip olarak uygulamamızı 3 hafta gibi kısa bir sürede hızlıca geliştirmek için ilk kez SCRUM metodunu kullandık. Uygulama restoranlar için bir envanter yönetim sistemidir ve bu versiyon Tina-Zita şirketi için geliştirilmiştir. Hedefimiz M.Y-Inventory'nin kullanımını mümkün olduğunca kolaylaştırmaktı ve ayrıca farklı olası kullanım durumları için gelişmiş bir mobil kullanıcı deneyimi de ekledik. Uygulama ayrıca üç farklı dili desteklemektedir; İngilizce, Türkçe ve Arapça.",
      "text1": "Bu web sitesinin amacı, ihtiyacı olanlara yemek kuponu bağışı toplamaktı. Bu proje gerçek hayattaki bir şirket projesine en yakın projey deneyimiydi çünkü bir baş mühendisimiz vardı ve geliştirme metodu olarak SCRUM kullanmıştık. Geliştirme için ReactJS'yi, verileri depolamak için Firebase'i ve stil oluşturmak için Ant Design'ı kullandık. Ödemeleri işlemek için Stripe API, grafikler için ChartJS, blogumuz için Wordpress API, dil desteği için i18next kullandık. Ayrıca tasarımlarımız için bir UI / UX tasarımcısıyla çalıştık ve Figma'yı kullandık.",
      "text2": "Bu projenin amacı, yapılacaklar uygulamasına benzer bir pano uygulaması oluşturmaktı. Partnerim ve ben haftalık bir egzersiz planlama uygulaması yapmaya karar verdik. Bu projede ReactJS'i ilk kez kullandım ve React'i anlamak için iyi bir uygulama oldu. Ayrıca uygulamayı şekillendirmek için Ant Design'ı ve kullanıcı verilerini depolamak için Google Firebase'i kullandım.",
      "text3": "Bu proje, filmleri, oyuncuları arayabileceğiniz ve popüler filmleri, TV şovlarını vb. görebileceğiniz IMDb web sitesine benzer bir web sitesidir. Bu projede, ortağım ve ben gerekli film verilerini almak için nesne yönelimli programlama ve MovieDb API kullandık. Ayrıca, vanilya JavaScript, HTML ve stil için CSS ile Bootstrap kullandım.",
      "text4": "Bu web sitesinin amacı  Madlibs oyunu oynamaktır. Ayrıca Türkçe ve İngilizce dil desteğine sahiptir. Yerel depolamayı kullanarak sözcüklerinizi kaydedebilir. Bu projede, ilk defa pair programming ile bir ortakla çalıştım ve bu benim ilk vanilya JavaScript, HTML, CSS projemdi. Ayrıca, regular expressions, i18next kütüphanesi, yerel depolama gibi teknolojileri tecrübe ettim. Projenin tarzı tamamen CSS idir, yani stil için herhangi bir framework kullanmadım.",
      "text5": "Bu, TypeORM ile Express js ve REST API alıştırması yapmak için basit bir full stack projesidir. Uygulama, insanları Re:Coded Bootcamp mezuniyetime davet etmek için yapılmıştır.",
      "text6": "Bu, toplama, çarpma, determinantı bulma ve ters matrislerle ilgilenme gibi çeşitli matris işlemlerini içeren bir JetBrains Academy projesidir.",
      "text7": "Bu, bir finansal kredi hesaplayıcısı içeren bir JetBrains Academy projesidir. Projenin ilk aşamaları kullanıcıdan girdi alıyor ve konsoldan çalışıyordu. Son aşamada bir CLI programına dönüştü ve terminalden çalışmaya başladı.",
      "text8": "Bu bir JetBrains Academy projesi ve basit bir adam asmaca oyunudur.",
      "text9": "Bu bir JetBrains Academy projesi ve iki oyunculu bir tic tac toe oyunudur.",
      "text10": "Bu bir JetBrains Academy projesi ve bir taş kağıt makas oyunudur.",
      "text11": "Bu bir JetBrains Academy projesidir ve bu projede, kullanıcının işlem sırasına göre dört işlem yapabileceği akıllı bir hesap makinesi oluşturdum. Ayrıca önceki hesaplamaları hatırlayacak kadar da akıllıdır.",
      "text12": "Bu bir JetBrains Academy projesidir ve bu projede, kolay, orta, zor gibi farklı yapay zeka seviyerine karşı tic-tac-toe oynayabilirsiniz. Oyun ayrıca iki kişi oynanabilir ve yapay zekalar birbirine karşı oynayabilir."
    },
    "links": {
      "link0": "GitHub repository",
      "link1": "Sayfayı ayrı bir pencerede açın"
    },
    "bolds": {
      "bold0": "Çalıştığım konular: ",
      "bold1": "Kullanılan teknolojiler: "
    }
  },
  "contact": {
    "titles": {
      "title0": "Benimle iletişime geçin",
      "title1": "Diğer iletişim bilgileri"
    },
    "labels": {
      "label0": "E-posta adresiniz",
      "label1": "Tam adınız",
      "label2": "Konu",
      "label3": "Mesajınız"
    },
    "placeholders": {
      "holder0": "ali.veli@mail.com",
      "holder1": "Ali Veli",
      "holder2": "Ne hakkında?",
      "holder3": "Merhaba, Bertaç!"
    },
    "button": "Gönder",
    "headers": {
      "head0": "Adres",
      "head1": "Telefon",
      "head2": "E-posta Adresi",
      "head3": "Sosyal Medya"
    },
    "texts": {
      "text0": "İstanbul/Türkiye",
      "text1": "GitHub profil linki",
      "text2": "LinkedIn profil linki",
      "text3": "JetBrains Academy profil linki"
    }
  },
  "about": {
    "title": "Merhaba",
    "headers": {
      "head0": "Benim adım Bertaç Severcan ve kendimi size tanıtmak isterim:",
      "head1": "Kısaca: Hem backend hem de frontend ile ilgilenen bir yazılım/web geliştiricisiyim ve iş arıyorum, beni işe alın!"
    },
    "texts": {
      "text0": "İstanbul, Türkiye'de bir yazılım/web geliştiricisiyim. İstanbul Bilgi Üniversitesi'nde Yönetim Bilişim Sistemleri ve İngilizce öğretmenliği (Çift Anadal) okudum. Ayrıca, web geliştirme becerilerimi kazandığım Re:Coded Web geliştirme Bootcamp'a (Flatiron School müfredatını kullanır) katıldım ve mezun oldum.",
      "text1": "Bootcamp'tan önce Bilgi Üniversitesi'nde Java ile programlamaya başladım. Sonra orada SQL ve RDBMS'yi öğrendim. Programlama becerilerimi geliştirmek için Python'u kendim öğrenmeye başladım ve Python'u çok sevdim. Re:Coded Bootcamp'ı başladığımda, web geliştirmeyi bilmiyordum ve onu ilk orada öğrendim. İlk olarak HTML ve CSS ile başladık, ardından JavaScript ile devam ettik. Son olarak, ReactJS ile bitirdik ve kamp sonunda ki bitirme projesinde SCRUM metodunu ilk elden deneyimleme şansını yakaladım.",
      "text2": "Eğitim kampında geçirdiğim süre içinde birçok yeni beceri ve bilgi öğrendim. Git ve VCS'in kariyerim için ne kadar önemli olduğunu gördüm. Ayrıca bu süre zarfında farklı takım arkadaşlarıyla birçok proje üzerinde çalıştım. Hatta Bootcamp'tan bir grup geliştirici ile bir takım kurdum ve web uygulamamız M.Y-Inventory ile 3'üncülük ödülünü kazandığımız bir hackathon'a katıldım. Ayrıca, Bootcamp'a katılmadan hemen önce, 'Çaylak Kodcular' (Rookie Coders) adlı çevrimiçi çalışma grubumu kurdum. Programlama hakkında bilgi edinmek isteyen herkese açık bir Discord kanalıydı. Bu deneyimden hem çok şey kazandım hem de insanlara yardım etmeye çalıştım.",
      "text3": "Programlamayı çok sevmemin nedeni, ne kadar yaratıcılığa izin vermesidir, fikirlerimi gerçeğe dönüştürmeme izin vermesidir. Ayrıca programlamaya başladığımda problem çözmeyi sevdiğimi de fark ettim. Bir keresinde bir proje üzerinde çalışıyordum, bütün günümü yaşadığım problemi çözmek için çalışarak geçirdim. Bu durumdan hiç sıkılmadım ve o zaman bunu tereddüt etmeden hayatım boyunca yapabileceğimi anladım.",
      "text4": "Her türlü yazılım geliştirmeyle ilgileniyorum; mobil, web, yazılım, video oyunu. Ama hedeflerimden biri bir gün kendi video oyunumu yapmak. Buradan da kolayca tahmin edebileceğiniz gibi, video oyunları oynamayı seviyorum ama çoğunlukla hikaye odaklı olanları.",
      "text5": "Programlama kadar sevdiğim bir diğer şey de müzik. Üç farklı enstrüman çalıyorum; piyano, davul, gitar ve bir gün programlama ve müzik sevgimi birleştirmek istiyorum. Ayrıca CrossFit yapıyorum ve CrossFit'te Seviye-1 eğitmen sertifikam var. Ama sürekli CrossFit hakkında konuşan o adam olmak istemiyorum, bu yüzden duracağım ",
      "text6": "Ve evet, işte bu benim! Eğer benimle",
      "text7": "ileşime geçmek",
      "text8": "ve beni daha fazla tanımak isterseniz lütfen buyurun!"
    }
  },
  "resume": {
    "texts": {
      "text0": "Problem çözme tutkusuna sahip full-stack web geliştiricisi. Python, Java, SQL, JavaScript, and React gibi dillerde deneyim sahibi ve Yönetim Bilgi Sistemlerinde bir geçmişe sahip olarak web geliştirmeyi Re:Coded Web Development Bootcamp aracılığıyla keşfettim. Ekip çalışması ve teknoloji şirketlerinin değerlerini artırmalarına yardımcı olacak çözümler oluşturma konusunda güçlü beceriler sunuyorum. Yeni şeyler öğrenmeye ve kendimi her şekilde geliştirmeye daima açığım.",
      "text1": "Üçüncülük ödülü kazanmış, restoranların envanterlerini kontrol edebilmeleri için envanter yönetim sistemi.",
      "text2": "İthiyacı olanlara yardım amaçlı bağışçılar ve restoranları bir araya getiren, yemek kuponu bağış sitesi.",
      "text3": "Haftalık idmanlarınızı girebildiğiniz ve kontrol edebildiğiniz, haftalık idman planlama uygulaması."
    },
    "headers": {
      "head0": "TEKNİK PROJELER",
      "head1": "TEKNİK BECERİLER",
      "head2": "İŞ DENEYİMİ",
      "head3": "EĞİTİM",
      "head4": "DİLLER"
    },
    "list0": {
      "li0": "Stil için Ant Design ve React kullanarak, kullanıcı arayüzü geliştirildi.",
      "li1": "Envanter öğeleri, menüler ve siparişler için verileri depolamak için Firebase Cloud Firestore'u kullanıldı.",
      "li2": "Kullanıcılarımıza sistemin nasıl kullanılacağıyla ilgili eğitici videolar göstermek için YouTube’un video yerleştirme özelliği kullanıldı.",
      "li3": "Restoran yöneticisi için kullanıcı erişimi oluşturmak üzere Firebase Authentication etkinleştirildi.",
      "li4": "Kullanıcı arayüzünü İngilizce, Türkçe ve Arapça gibi 3 farklı dile çevirmek için i18next kullanıldı.",
      "li5": "SCRUM metodu kullanarak 4 diğer ekip üyesiyle birlikte çalışıldı."
    },
    "list1": {
      "li0": "Stil için Ant Design ve React kullanarak, kullanıcı arayüzü geliştirildi.",
      "li1": "Restoranlar ve yemek kuponları için verileri ve görüntüleri depolamak için Firebase Cloud Firestore ve Storage'dan yararlanıldı.",
      "li2": "Kullanıcıları dünyadaki açlıkla ilgili eğitmek için WordPress API uygulandı.",
      "li3": "ChartJS bir restoran için satılan kupon miktarından elde edilen istatistiksel verileri göstermek için etkinleştirildi.",
      "li4": "Restoran kullanıcı girişi akışı için Firebase Authentication kullanıldı.",
      "li5": "Kupon bağışlarını ödeme olarak doğrulamak için Stripe API kullanıldı.",
      "li6": "SCRUM metodu kullanarak 3 diğer ekip üyesi ve bir baş mühendis ile birlikte çalışıldı.",
      "li7": "Kullanıcı arayüzünü İngilizce, Türkçe ve Arapça gibi 3 farklı dile çevirmek için i18next kullanıldı."
    },
    "list2": {
      "li0": "Stil için Ant Design ve React kullanarak, kullanıcı arayüzü geliştirildi.",
      "li1": "Antrenman planları ve antrenmanlara ilişkin verileri depolamak için Firebase Cloud Firestore kullanıldı.",
      "li2": "Pair programming kullanarak bir takım üyesi ile çalışıldı."
    },
    "list3": {
      "li0": "Faturaların dokümantasyonuna yardımcı olarak verimlilik arttırıldı.",
      "li1": "Kurum içi bilgi sistemi test edildi ve gelecekte sistemi iyileştirmek için kullanıcılara anket hazırlandı."
    },
    "list4": {
      "li0": "Front End Web Development (HTML, CSS, JavaScript, React)",
      "li1": "Flatiron School ders planı kullanan Re:Coded tarafından verilen 5 aylık yoğun web geliştirme programı."
    },
    "list5": "Bölüm: Yönetim Bilişim Sistemleri",
    "list6": "Bölüm: İngilizce Öğretmenliği",
    "employment": {
      "company0": {
        "city": "İstanbul",
        "country": "Türkiye ",
        "position": "IT Stajyeri",
        "date": "Ocak/2020 - Şubat/2020",
        "website": "Şirket websitesine git"
      }
    },
    "school": "İstanbul Bilgi Üniversitesi"
  },
  "footer": {
    "text0": "Bertaç Severcan tarafından ",
    "text1": "ile yapılmıştır"
  }
}
