{
  "home": {
    "titles": {
      "title0": "Merhaba, Dünya!",
      "title1": "Benim adım Bertaç Severcan,"
    },
    "texts": {
      "text0": "Ben teknoloji ve programlamayla ilgilenen, bir junior yazılım/web geliştiricisiyim.",
      "text1": "İstanbul Bilgi Üniversitesi Yönetim Bilişim Sistemleri ve İngilizce Öğretmenliği bölümleri (ÇAP) mezunuyum ve 6 aylık Re:Coded Web Geliştirme Kampından da başarıyla mezun oldum.",
      "text2": "Python, Java, Javascript, HTML, CSS, SQL gibi programlama dillerinde deneyim sahibiyim ve hem backend hem de frontend yazılım geliştirme ile ilgileniyorum.",
      "text3": "Her zaman yenilikler peşinde olmayı ve yeni şeyler öğrenmeyi seviyorum."
    },
    "buttons": {
      "button0": "Projelerime bakın",
      "button1": "Hakkımda daha fazla"
    }
  },
  "navbar": {
    "links": {
      "link0": "Ana sayfa",
      "link1": "Hakkımda",
      "link2": "Özgeçmiş",
      "link3": "Projelerim",
      "link4": "İletişim",
      "link5": "Dil"
    },
    "languages": {
      "tr": "Türkçe",
      "en": "İngilizce"
    }
  },
  "projects": {
    "titles": {
      "title0": "Projelerim",
      "title1": "Diğer projelerim"
    },
    "texts": {
      "text0": "With this application my team and I won the 3'rd place in Impact Hub Innovation Hackathon 2020. At the moment you can't reach this website without an authorized account. As a team we used SCRUM for the first time to develop our application rapidly in 3 weeks. The application's purpose was to manage the inventory of a restaurant (Tina Zita). Our goal was to make M.Y-Inventory easy to use and we also added an enhanced mobile user experience for  different possible use cases. The application also supports three different languages; English, Turkish and Arabic.",
      "text1": "The purpose of this website was to collect food coupon donations for the people in need. This project was the closest one to a real-life company project because we had a lead-engineer and we used SCRUM for development. We used ReactJS for development, Firebase to store data and Ant Design for styling. We've used Stripe API to handle payments, ChartJS for graphs, Wordpress API for our blog, i18next for language support. We've also worked with a UI/UX designer for our designs and used Figma.",
      "text2": "The purpose of this project was to create a board app which is similar to a to-do app. My partner and I decided to do a weekly-workout-planning app. In this project, I've used ReactJS for the first time and it was such a good practice for me to understand React. I've also used Ant Design to style the application and used Google's Firebase to store user data.",
      "text3": "This project was similar to the IMDb website which you can search for movies, actors and see popular movies, tv shows etc. In this project, my partner and I've used object-oriented programming and MovieDb API to fetch the necessary movie data. Also, I used vanilla JavaScript, HTML and Bootstrap with CSS for styling.",
      "text4": "The purpose of the website is to play mad libs. It also has Turkish and English language support. It can save your words by using local storage.  For the first time, I did pair programming and worked on a project with a partner and it was my first ever vanilla JavaScript, HTML, CSS project. Also, it was the first time that I learned about and worked with regular expressions, i18next library, local storage. The style of the project was purely CSS. I didn't use any frameworks for styling.",
      "text5": "This is a simple full stack project to practice Express js and REST API with TypeORM. The app simply invites people to my graduation from the Re:Coded Bootcamp.",
      "text6": "This is a JetBrains Academy project which contains various matrix operations including addition, multiplication, finding the determinant, and dealing with inverse matrices.",
      "text7": "This is a JetBrains Academy project which contains a financial loan-credit calculator. The first stages of the project was getting input from the user and was running from the console. At the last stage, it switched to a CLI program and ran from the terminal.",
      "text8": "This is a JetBrains Academy project and it's a simple game of hangman.",
      "text9": "This is a JetBrains Academy project and it's a 2-player game of tic tac toe.",
      "text10": "This is a JetBrains Academy project and it's a game of rock paper scissors.",
      "text11": "This is a JetBrains Academy project and In this project, I have created a smart calculator which the user can do basic operations with an order of precedence. It's also smart enough to remember previous calculations."
    },
    "links": {
      "link0": "GitHub repository",
      "link1": "Sayfayı ayrı bir pencerede açın"
    },
    "bolds": {
      "bold0": "Topics practised: ",
      "bold1": "Technologies used: "
    }
  },
  "contact": {
    "titles": {
      "title0": "Benimle iletişime geçin",
      "title1": "Diğer iletişim bilgileri"
    },
    "labels": {
      "label0": "E-posta adresiniz",
      "label1": "Tam adınız",
      "label2": "Konu",
      "label3": "Mesajınız"
    },
    "placeholders": {
      "holder0": "ali.veli@mail.com",
      "holder1": "Ali Veli",
      "holder2": "Ne hakkında?",
      "holder3": "Merhaba, Bertaç!"
    },
    "button": "Gönder",
    "headers": {
      "head0": "Adres",
      "head1": "Telefon",
      "head2": "E-posta Adresi",
      "head3": "Sosyal Medya"
    },
    "texts": {
      "text0": "İstanbul/Türkiye",
      "text1": "GitHub profil linki",
      "text2": "LinkedIn profil linki"
    }
  },
  "about": {
    "title": "Merhaba",
    "headers": {
      "head0": "Benim adım Bertaç Severcan ve kendimi size tanıtmak isterim:",
      "head1": "TL;DR: I'm a junior software/web developer who is interested in both backend and frontend and I'm looking for work, hire me!"
    },
    "texts": {
      "text0": "I am a junior software/web developer from Istanbul, Turkey. I studied Management Information Systems and Teaching English As a Foreign Language(Double Majors) at Istanbul Bilgi University. I also attended and graduated from Re: Coded Web development Bootcamp(uses Flatiron School's curriculum) where I gained my skills in front-end web development.",
      "text1": "Before the Bootcamp, I started programming in Java at Bilgi University. Then I learned about SQL and RDBMS there. To improve my skills in programming, I started to learn Python myself and loved it. When I started the Re: Coded Bootcamp, I didn't know about web development and that was where I first learned about it. We started with HTML and CSS, then moved on with JavaScript. Lastly, we finished with ReactJS and I also got the chance to learn about SCRUM and experience it first hand in the capstone project.",
      "text2": "In my time within the Bootcamp, I've learned many new skills and knowledge. I've learned about Git and VCS and how important it was for my career. Also, I've worked on many projects with different partners during this time. I even formed a group of developers from the Bootcamp and attended a hackathon where we got 3'rd overall with our web-app: M.Y-Inventory. Also, right before I joined the Bootcamp, I formed my online study-group called 'Çaylak Kodcular' (Rookie Coders). It was a Discord channel open to anyone who wanted to learn about programming. From this experience, I've both gained a lot and I tried to give back too.",
      "text3": "The reason I fell in love with programming is how creative it can be, it allowed me to build something from nothing. I also realized when I started programming, I love solving problems. One time, I was working on a project, I spent my entire day working on solving the problem I had and I didn't even get bored and that's when I realized I can do this without hesitation.",
      "text4": "I'm interested in all sorts of development; mobile, web, software, video-game. But one of my goals is to build my own video-game someday. As you can easily guess from this, I love playing video-games but mostly story-driven ones.",
      "text5": "The other thing I love as much as programming is music. I play three different instruments; piano, drums, guitar and I'd like to combine my love for programming and music one day. Oh, and I also do CrossFit and I have a Level-1 trainer certificate in CrossFit. But I don't want to be that guy who talks about CrossFit all the time so I'll stop ",
      "text6": "So, yeah, this is me! If you want to",
      "text7": "contact me",
      "text8": " and get to know me even more, please do!"
    }
  },
  "resume": {
    "texts": {
      "text0": "Full-stack web developer with a passion for problem-solving. With experience in Python, Java, SQL, JavaScript, and React and a background in Management Information Systems, I discovered web development through Re:Coded Web Development Bootcamp. I bring strong skills in team-building and creating solutions that help tech companies increase their values. Always open to learn new things and improve in every way possible.",
      "text1": "A 3’rd place award-winning inventory management system for restaurants to keep track of their inventory.",
      "text2": "A food coupon donation website that connects the donors with the restaurants for the people in need.",
      "text3": "A workout planner app which you can enter your weekly workouts and keep track of them."
    },
    "headers": {
      "head0": "TECHNICAL PROJECTS",
      "head1": "TECHNICAL SKILLS",
      "head2": "EMPLOYMENT HISTORY",
      "head3": "EDUCATION",
      "head4": "LANGUAGES"
    },
    "list0": {
      "li0": "Developed a user interface utilizing React and Ant Design for styling.",
      "li1": "Employed Firebase Cloud Firestore to store and fetch data for inventory items, menus and orders.",
      "li2": "Used YouTube’s embed video feature to show tutorial videos for our users about how to use the system.",
      "li3": "Enabled Firebase Authentication to create user access for the restaurant manager.",
      "li4": "Used i18next to translate the user interface for 3 different languages, such as English, Turkish and Arabic.",
      "li5": "Worked with 4 other team members using SCRUM."
    },
    "list1": {
      "li0": "Developed a user interface using React and Ant Design for styling.",
      "li1": "Utilized Firebase Cloud Firestore and storage to store data and images for the restaurants and food coupons.",
      "li2": "Implemented the WordPress API to educate users about world hunger.",
      "li3": "Enabled ChartJS to show statistical data derived from the amount of sold coupons for a restaurant.",
      "li4": "Used Firebase Authentication for restaurant user login flow.",
      "li5": "Employed Stripe API to validate coupon donations as payment.",
      "li6": "Worked with 3 other team members and a lead engineer using SCRUM.",
      "li7": "Used i18next to translate the user interface for 3 different languages, such as English, Turkish and Arabic."
    },
    "list2": {
      "li0": "Developed a user interface using React and Ant Design for styling.",
      "li1": "Utilized Firebase Cloud Firestore to store data for the workout plans and workouts.",
      "li2": "Worked with a partner pair programming."
    },
    "list3": {
      "li0": "Increased the efficiency by helping in the documentation of bills.",
      "li1": "Tested the in-house information system and prepared a survey for the users to improve the system in the future."
    },
    "list4": {
      "li0": " Front End Web Development (HTML, CSS, JavaScript, React)",
      "li1": "5-month intense web development program run by Re:Coded with Flatiron School's curriculum."
    },
    "list5": "Degree: Management Information Systems",
    "list6": "Degree: Teaching English as a Foreign Language",
    "employment": {
      "company0": {
        "city": "Istanbul",
        "country": "Turkey ",
        "position": "IT Intern",
        "date": "January/2020 - February/2020",
        "website": "Go to company website"
      }
    },
    "school": "Istanbul Bilgi University"
  }
}
