{
  "home": {
    "titles": {
      "title0": "Merhaba, Dünya!",
      "title1": "Benim adım Bertaç Severcan,"
    },
    "texts": {
      "text0": "Ben teknoloji ve programlamayla ilgilenen, bir junior yazılım/web geliştiricisiyim.",
      "text1": "İstanbul Bilgi Üniversitesi Yönetim Bilişim Sistemleri ve İngilizce Öğretmenliği bölümleri (ÇAP) mezunuyum ve 6 aylık Re:Coded Web Geliştirme Kampından da başarıyla mezun oldum.",
      "text2": "Python, Java, Javascript, HTML, CSS, SQL gibi programlama dillerinde deneyim sahibiyim ve hem backend hem de frontend yazılım geliştirme ile ilgileniyorum.",
      "text3": "Her zaman yenilikler peşinde olmayı ve yeni şeyler öğrenmeyi seviyorum."
    },
    "buttons": {
      "button0": "Projelerime bakın",
      "button1": "Hakkımda daha fazla"
    }
  },
  "navbar": {
    "links": {
      "link0": "Ana sayfa",
      "link1": "Hakkımda",
      "link2": "Özgeçmiş",
      "link3": "Projelerim",
      "link4": "İletişim",
      "link5": "Dil"
    },
    "languages": {
      "tr": "Türkçe",
      "en": "İngilizce"
    }
  },
  "projects": {
    "title": "Projelerim",
    "texts": {
      "text0": "With this application my team and I won the 3'rd place in Impact Hub Innovation Hackathon 2020. At the moment you can't reach this website without an authorized account. This is the first project that I worked on as a group of 5 people and it was outside of Re: Coded Bootcamp. I've formed a team of 5 people from the bootcamp and attended the Impact Hub Innovation Hackathon 2020. As a group we used SCRUM for the first time to develop our application rapidly in 3 weeks. The application's purpose was to manage the inventory of a restaurant (Tina Zita). We were using React for development, Firebase to store data, Ant Design for styling and Sentry.io to catch crashes. Our goal was to make M.Y-Inventory easy to use and we also added an enhanced mobile user experience for  different possible use cases. The application also supports three different languages; English, Turkish and Arabic with fully responsive design. Overall, this project was outside of my comfort zone but it was fun to put myself out there and I learned a lot thanks to this project.",
      "text1": "This is the last project that I've worked on during the Re: Coded Bootcamp. It is the capstone project and I've worked with a group of four people. The purpose of this website was to collect food coupon donations for the people in need. This project was the closest one to a real-life company project because we had a lead-engineer and we used SCRUM for development. We used ReactJS for development, Firebase to store data and Ant Design for styling. We've used iyzico API to handle payments, ChartJS for graphs, Wordpress API for our blog, i18next for language support and Redux for global states. We've also worked with a UI/UX designer for our designs and used Figma. Overall, this project was challenging but great as a good learning experience.",
      "text2": "This is the third project that I've worked on during the Re: Coded Bootcamp with my bro Ihab (Hello Ihab!). The purpose of this project was to create a board app which is similar to a to-do app. We decided to do a weekly-workout-planning app. In this project, I've used ReactJS for the first time and it was such a good practice for me to understand React. I've also used Ant Design to style the application. Also, I've used Google's Firebase to store user data. Overall, this project was challenging but so much fun and full of learning experience.",
      "text3": "This is the second project that I've worked on during the Re: Coded Bootcamp with a partner (Hello Tarkan!). This project was similar to the IMDb website which you can search for movies, actors and see popular movies, tv shows etc. In this project, I've used object-oriented programming and used MovieDb API to fetch the necessary movie data. Also, I used vanilla JavaScript, HTML and Bootstrap with CSS for styling. Overall, this project was more challenging than the previous Madlibs however; I was able to overcome the difficulties.",
      "text4": "This is the first project that I've worked on during the time of the Re: Coded Bootcamp. The purpose of the website is to play mad libs. It also has Turkish and English language support. It can save your words by using local storage.  For the first time, I did pair programming and worked on a project with a partner (Hello Knar!) and it was my first ever vanilla JavaScript, HTML, CSS project. Also, it was the first time that I learned about and worked with regular expressions, i18next library, local storage. The style of the project was purely CSS. I didn't use any frameworks for styling. Overall, I had so much fun with this project and learned a lot too."
    },
    "links": {
      "link0": "GitHub repository",
      "link1": "Sayfayı ayrı bir pencerede açın"
    }
  },
  "contact": {
    "titles": {
      "title0": "Benimle iletişime geçin",
      "title1": "Diğer iletişim bilgileri"
    },
    "labels": {
      "label0": "E-posta adresiniz",
      "label1": "Tam adınız",
      "label2": "Konu",
      "label3": "Mesajınız"
    },
    "placeholders": {
      "holder0": "ali.veli@mail.com",
      "holder1": "Ali Veli",
      "holder2": "Ne hakkında?",
      "holder3": "Merhaba, Bertaç!"
    },
    "button": "Gönder",
    "headers": {
      "head0": "Adres",
      "head1": "Telefon",
      "head2": "E-posta Adresi",
      "head3": "Sosyal Medya"
    },
    "texts": {
      "text0": "İstanbul/Türkiye",
      "text1": "GitHub profil linki",
      "text2": "LinkedIn profil linki"
    }
  },
  "about": {
    "title": "Merhaba",
    "headers": {
      "head0": "Benim adım Bertaç Severcan ve kendimi size tanıtmak isterim:",
      "head1": "TL;DR: I'm a junior software/web developer who is interested in both backend and frontend and I'm looking for work, hire me!"
    },
    "texts": {
      "text0": "I am a junior software/web developer from Istanbul, Turkey. I studied Management Information Systems and Teaching English As a Foreign Language(Double Majors) at Istanbul Bilgi University. I also attended and graduated from Re: Coded Web development Bootcamp(uses Flatiron School's curriculum) where I gained my skills in front-end web development.",
      "text1": "Before the Bootcamp, I started programming in Java at Bilgi University. Then I learned about SQL and RDBMS there. To improve my skills in programming, I started to learn Python myself and loved it. When I started the Re: Coded Bootcamp, I didn't know about web development and that was where I first learned about it. We started with HTML and CSS, then moved on with JavaScript. Lastly, we finished with ReactJS and I also got the chance to learn about SCRUM and experience it first hand in the capstone project.",
      "text2": "In my time within the Bootcamp, I've learned many new skills and knowledge. I've learned about Git and VCS and how important it was for my career. Also, I've worked on many projects with different partners during this time. I even formed a group of developers from the Bootcamp and attended a hackathon where we got 3'rd overall with our web-app: M.Y-Inventory. Also, right before I joined the Bootcamp, I formed my online study-group called 'Çaylak Kodcular' (Rookie Coders). It was a Discord channel open to anyone who wanted to learn about programming. From this experience, I've both gained a lot and I tried to give back too.",
      "text3": "The reason I fell in love with programming is how creative it can be, it allowed me to build something from nothing. I also realized when I started programming, I love solving problems. One time, I was working on a project, I spent my entire day working on solving the problem I had and I didn't even get bored and that's when I realized I can do this without hesitation.",
      "text4": "I'm interested in all sorts of development; mobile, web, software, video-game. But one of my goals is to build my own video-game someday. As you can easily guess from this, I love playing video-games but mostly story-driven ones.",
      "text5": "The other thing I love as much as programming is music. I play three different instruments; piano, drums, guitar and I'd like to combine my love for programming and music one day. Oh, and I also do CrossFit and I have a Level-1 trainer certificate in CrossFit. But I don't want to be that guy who talks about CrossFit all the time so I'll stop ",
      "text6": "So, yeah, this is me! If you want to",
      "text7": "contact me",
      "text8": " and get to know me even more, please do!"
    }
  }
}
